# Operations

Lets work through some operations in pandas that do not naturally fit into prior modules

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'Trade':[1,2,3,4],'GDP':[16,13,7,7],'Country':['US','CHN','IND','GER']})
df.head()

   Trade  GDP Country
0      1   16      US
1      2   13     CHN
2      3    7     IND
3      4    7     GER

### Info on Unique Values

In [3]:
df['GDP'].unique()

array([16, 13,  7], dtype=int64)

In [4]:
df['GDP'].nunique()

3

In [5]:
df['GDP'].value_counts()

7     2
13    1
16    1
Name: GDP, dtype: int64

### Selecting Data

In [6]:
#Select from DataFrame using criteria from multiple columns
df1 = df[(df['Trade']>0) & (df['GDP']==16)]

In [7]:
df1

   Trade  GDP Country
0      1   16      US

### Applying Functions

In [8]:
def times2(x):
    return x*2

In [9]:
df['Trade'].apply(times2)

0    2
1    4
2    6
3    8
Name: Trade, dtype: int64

In [10]:
df['Country'].apply(len)

0    2
1    3
2    3
3    3
Name: Country, dtype: int64

In [12]:
df['Trade'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: Trade, dtype: int64

In [11]:
df['Trade'].sum()

10

** Permanently Removing a Column**

In [13]:
del df['Trade']

In [14]:
df

   GDP Country
0   16      US
1   13     CHN
2    7     IND
3    7     GER

** Get column and index names: **

In [15]:
df.columns

Index(['GDP', 'Country'], dtype='object')

In [16]:
df.index

RangeIndex(start=0, stop=4, step=1)

** Sorting and Ordering a DataFrame:**

In [17]:
df

   GDP Country
0   16      US
1   13     CHN
2    7     IND
3    7     GER

In [18]:
df.sort_values(by='GDP') #inplace=False by default

   GDP Country
2    7     IND
3    7     GER
1   13     CHN
0   16      US

** Find Null Values or Check for Null Values**

In [19]:
df.isnull()

     GDP  Country
0  False    False
1  False    False
2  False    False
3  False    False

In [20]:
# Drop rows with NaN Values
df.dropna()

   GDP Country
0   16      US
1   13     CHN
2    7     IND
3    7     GER

** Filling in NaN values with something else: **

In [21]:
import numpy as np

In [22]:
import pandas as pd
df = pd.DataFrame({'Trade':[1,2,3,4],'GDP':[16,np.NaN,7,7],'Country':['US','CHN',np.NaN,'GER']})
df.head()

   Trade   GDP Country
0      1  16.0      US
1      2   NaN     CHN
2      3   7.0     NaN
3      4   7.0     GER

In [23]:
df.fillna('FILL')

   Trade   GDP Country
0      1    16      US
1      2  FILL     CHN
2      3     7    FILL
3      4     7     GER